garyPenhook/PyAvrOCD/svd/atmega1284rfr2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00800000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>No Description.</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2V4</name>
                  <description>Brown-out detection at VCC=2.4 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V3</name>
                  <description>Brown-out detection at VCC=2.3 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V2</name>
                  <description>Brown-out detection at VCC=2.2 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V1</name>
                  <description>Brown-out detection at VCC=2.1 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V0</name>
                  <description>Brown-out detection at VCC=2.0 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V9</name>
                  <description>Brown-out detection at VCC=1.9 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>Brown-out detection at VCC=1.8 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Brown-out detection disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>No Description.</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOTRST</name>
              <description>Boot Reset vector Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTSZ</name>
              <description>Select Boot Size</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4096W_F000</name>
                  <description>Boot Flash size=4096 words start address=$F000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048W_F800</name>
                  <description>Boot Flash size=2048 words start address=$F800</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024W_FC00</name>
                  <description>Boot Flash size=1024 words start address=$FC00</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512W_FE00</name>
                  <description>Boot Flash size=512 words start address=$FE00</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watchdog timer always on</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTAGEN</name>
              <description>JTAG Interface Enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCDEN</name>
              <description>On-Chip Debug Enabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKSEL_SUT</name>
              <description>Select Clock Source : Start-up time</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_0MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_0MS</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 0 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_128KHZ_6CK_0MS</name>
                  <description>Int. 128kHz RC Osc.; Start-up time: 6 CK + 0 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_258CK_4MS1</name>
                  <description>Transceiver Oscillator; Start-up time: 258 CK + 4.1 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_1KCK_65MS</name>
                  <description>Transceiver Oscillator; Start-up time: 1K CK + 65 ms</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_4MS1</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 4.1 ms</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_4MS1</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 4.1 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_128KHZ_6CK_4MS1</name>
                  <description>Int. 128kHz RC Osc.; Start-up time: 6 CK + 4.1 ms</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_258CK_65MS</name>
                  <description>Transceiver Oscillator; Start-up time: 258 CK + 65 ms</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_16KCK_0MS</name>
                  <description>Transceiver Oscillator; Start-up time: 16K CK + 0 ms</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_65MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 65 ms</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_65MS</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 65 ms</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_128KHZ_6CK_65MS</name>
                  <description>Int. 128kHz RC Osc.; Start-up time: 6 CK + 65 ms</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_1KCK_0MS</name>
                  <description>Transceiver Oscillator; Start-up time: 1K CK + 0 ms</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_16KCK_4MS1</name>
                  <description>Transceiver Oscillator; Start-up time: 16K CK + 4.1 ms</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_1KCK_4MS1</name>
                  <description>Transceiver Oscillator; Start-up time: 1K CK + 4.1 ms</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC_16KCK_65MS</name>
                  <description>Transceiver Oscillator; Start-up time: 16K CK + 65 ms</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTE7</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
